…_do_brk
Ж
_do_brk:
Г
В
„т,#10
је_mp
ј∆,м
је_mm_in+10
ј–,м
З
А
јг4
јв4
јд–
Ц
Й
ƒб16
adc в0
„б1
sbb в0
јг4
©
2: shr в1
rcr б1
®
1:
ј-10(с),л
џдЎ
А
Ѕ_who
”_sys_getт
К
К
ЅЎ
Ѕ-10(с)
°
”_adjust
§
ђ
Ќѕц
ўI0013
Ѕ_mm_in+10
ћI0014
Х
јб-1
А
I0014:
√_res_ptr
£
Е
Д
Б
…_adjust
_adjust:
Г
В
„т,#28
Т
ƒв6
јѕ,м
Т
ƒв12
ј∆,м
ј-1≈ц
І
З
ји∆
Ћжн
је4«
ƒе(п)
adc дн
ј-22(с),м
ј-20(с),л
јг4
јд‘
shr дcl
ј–,л
З
А
јв4
јд-22(с)
Ѕ–
Ѕ-20(с)
Ц
А
”.cmu4
Щ
jl I0023
јб-12
А
ћI0021
I0023:
јbx,∆
З
Ћжн
је«
„е–
sbb дн
ј-2ќ,м
ј-2≈,л
јд-2ќ
је-2≈
„б0
sbb в0
ў1f
÷дл
je 1f
№м
1: 
or ем
jle I0026
Ѕ–
ћI0027
I0026:
І
Ѕ«
I0027:
√-10(с)
јеѕ
Ђ
ƒдќ
јЎ,л
јдЎ
Ќ-10(с),л
jae I0029
јб-12
А
ћI0021
I0029:
јеѕ
јд4«
ј-12(с),л
јд4«
Ќќ,л
je I002C
јеѕ
јдќ
ј4«,л
or -1≈,#1
I002C:
јд-2ќ
је-2≈
„б0
sbb в0
ў1f
÷дл
je 1f
№м
1: 
or ем
jle I002F
Ч
ј-2‘,л
је-2‘
З
А
Ѕ«
јг4
јв4
јд-2ќ
Ѕ-2≈
Ц
Й
√н
√о
„жл
sbb зм
је-2‘
ј«,н
І
ƒв2
ј-2‘,м
З
А
Ѕ«
јг4
јв4
јд-2ќ
Ѕ-2≈
Ц
Й
√н
√о
„жл
sbb зм
је-2‘
ј(м),н
І
ƒв4
ј-2‘,м
З
А
Ѕ«
јг4
јв4
јд-2ќ
Ѕ-2≈
Ц
Й
√н
√о
ƒжл
adc зм
је-2‘
ј«,н
or -1≈,#2
I002F:
Т
јд38«
÷б32
Э
Ю
Ц
ј-1‘,л
Т
ји≈
јй≈
Ѕ12«
Ѕ6(п)
Ѕ16(р)
Ѕ10«
Ѕ4(п)
Ѕ-1‘
”_пze_ok
ƒт,#12
ј-1ќ,л
Ќ-1ќц
ўI00212
Ќ-1≈ц
je I00215
Ґ
„б_mproc
јв40
cwd
iрv м
И
А
”_sys_newmap
К
К
I00215:
З
А
ћI0021
I00212:
test -1≈,#1
je I00218
јеѕ
јд-12(с)
ј4«,л
I00218:
test -1≈,#2
je I0021B
Ч
ј-2‘,л
је-2‘
З
А
Ѕ«
јг4
јв4
јд-2ќ
Ѕ-2≈
Ц
Й
√н
√о
ƒжл
adc зм
је-2‘
ј«,н
І
ƒв2
ј-2‘,м
З
А
Ѕ«
јж#4
јв4
јд-2ќ
Ѕ-2≈
Ц
Й
√н
√о
ƒжл
adc зм
је-2‘
ј«,н
І
ƒв4
ј-2‘,м
З
А
Ѕ«
јг4
јв4
јд-2ќ
Ѕ-2≈
Ц
Й
√н
√о
„жл
sbb зм
је-2‘
ј«,н
I0021B:
јб-12
А
I0021:
Н
Е
Д
Б
…_пze_ok
_пze_ok:
Г
В
„т,#6
јг4
јдќ
sal дcl
ƒб16
„б1
јв16
Ћзо
рv м
Э
Ю
Ц
Ф
јг4
јд‘
sal дcl
ƒб16
„б1
јв16
Ћзо
рv м
Э
Ю
Ц
ђ
јг4
јд10(с)
sal дcl
ƒб16
„б1
јв16
Ћзо
рv м
Э
Ю
Ц
ј–,л
Э
Ю
Ґ
Ц
Ќб32
ўI0033
Ќ∆,#4096
jg I0035
јд–
ƒдѕ
Ќб4096
jle I0034
I0035:
јб-12
А
ћI0031
I0033:
£
ƒд∆
ƒд–
Ќб4096
jle I0034
јб-12
А
ћI0031
I0034:
јд‘
ƒд12(с)
Ќ1≈,л
jae I003D
јб-12
А
ћI0031
I003D:
З
А
I0031:
Н
Е
Д
Б
…_stack_fault
_stack_fault:
Г
В
„т,#6
јб40
mul ≈
ї
ƒв_mproc
ј∆,м
Ч
„б_mproc
јв40
cwd
iрv м
џе–
¶
А
”_sys_getт
К
К
І
Ѕ–
Ѕ10«
°
”_adjust
§
ђ
Ќѕц
ўI0043
Е
Д
Б
I0043:
І
ј34«ц
П1
А
°
”_пg_proc
К
К
Е
Д
Б
