…_do_пgnal
Ж
_do_пgnal:
Г
В
А
А
Ќ_mm_in+4ц
jle I0012
Ќ_mm_in+4,—
jle I0013
†
јб-22
А
Ъ
Х
Ќ_mm_in+4,#9
ўI0017
З
А
Ъ
I0017:
је_mm_in+4
ум
јжм
П
sal дcl
Ф
Ќ_mm_in+14,#1
ўI001A
је_mp
ƒв32
јѕ,м
Ѕ«
Э
Ю
Ч
Ц
Й
or дм
јеѕ
∞
је_mp
ƒв34
јѕ,м
Ч
not л
Ѕ«
Э
Ю
Ц
Й
÷ел
јиѕ
ј(п),м
ћI001B
I001A:
Ќ_mm_in+14ц
ўI001D
је_mp
ƒв32
јѕ,м
Ч
not л
Ѕ«
Э
Ю
Ц
Й
÷ел
јиѕ
ј(п),м
је_mp
ƒв34
јѕ,м
Ч
not л
Ѕ«
Э
Ю
Ц
Й
÷ел
јиѕ
ј(п),м
ћI001B
I001D:
је_mp
ƒв32
јѕ,м
Ч
not л
Ѕ«
Э
јв2
Ц
Й
÷ел
јиѕ
ј(п),м
је_mp
ƒв34
јѕ,м
Ѕ«
Э
Ю
Ч
Ц
Й
or дм
јеѕ
∞
је_mp
јж_mm_in+14
ј36«,н
I001B:
З
А
Я
Н
Е
Д
Б
…_do_kill
_do_kill:
Г
В
је_mp
Ѕ28«
Ѕ_mm_in+6
Ѕ_mm_in+4
”_check_пg
§
Е
Д
Б
…_do_kпg
_do_kпg:
Г
В
„т,#12
Ќ_who,#-1
je I0033
Ќ_who,#1
je I0033
јб-1
А
ћI0031
I0033:
је_mm_in+4
јЎ,м
јб40
mul Ў
ї
ƒв_mproc
ј∆,м
І
testb 38«,#1
je I0036
І
testb 38«,#4
je I0037
I0036:
З
А
ћI0031
I0037:
І
јд20«
ј–,л
Э
Ю
јд_mm_in+6
Ц
ј-12(с),л
ј_mp,#_mproc
І
ји_mp
јд24«
ј24(п),л
Ќ-12(с),#32768
ўI003B
ЅЎ
”_stack_fault
К
Ћax,л
А
ћI0031
I003B:
јѕц
I00310:
Ќѕ,—
jge I003D
£
№л
Ќб2
je I00311
£
№л
Ќб3
ўI00312
I00311:
З
А
ћI00313
I00312:
Ѕ–
I00313:
√-10(с)
£
№л
Ќб9
ўI00316
ј-10(с),#-1
I00316:
Э
Ю
£
Ѕ-12(с)
Ц
Э
Ю
Ц
јжл
Н
shr дcl
testb al,#1
je I003E
£
№л
Ћем
¶
А
Ѕ-10(с)
”_check_пg
§
I003E:
№ѕ
ћI00310
I003D:
ј_dont_reply,#1
З
А
I0031:
Н
Е
Д
Б
_check_пg:
Г
В
„т,#10
Ќќц
jle I0042
Ќќ,—
jle I0043
I0042:
јб-22
А
ћI0041
I0043:
јѕц
јдќ
ул
јжл
П
sal дcl
Э
Ю
Ц
јЎ,л
ј∆,#_mproc+120
I0049:
Ќ∆,#_mproc+640
jae I0046
І
testb 38«,#1
ўI004B
ћI0047
I004B:
ј–,#1
І
mov д28«
Ќ‘,л
je I004E
Ќ‘ц
je I004E
ј–ц
I004E:
Ќ≈ц
jle I00412
І
јд20«
Ќ≈,л
je I00412
ј–ц
I00412:
І
testb 38«,#4
je I00416
ј–ц
I00416:
Ќ≈ц
ўI00419
је_mp
ји∆
јд24(п)
Ќ24«,л
je I00419
ј–ц
I00419:
Ќ‘ц
ўI0041D
Ќ≈,#-1
ўI0041D
ј–,#1
I0041D:
Ќќ,#14
ўI00421
І
testb 38«,—
ўI00424
ћI0047
I00424:
І
ƒв38
ј-10(с),м
Ђ
÷б65519
∞
I00421:
Ќ–ц
je I0047
І
јдЎ
test 32«,л
je I00427
ћI0047
I00427:
№ѕ
У
°
”_пg_proc
К
К
Ч
„б_mproc
јв40
cwd
iрv м
А
”_unpause
К
Ќ≈ц
jle I0047
ћI0046
I0047:
ƒ∆,#40
ћI0049
I0046:
је_mp
testb 38«,#1
je I0042D
је_mp
testb 38«,#4
je I0042E
I0042D:
ј_dont_reply,#1
I0042E:
Ќѕц
jle I00432
З
А
ћI0041
I00432:
јб-3
А
I0041:
Н
Е
Д
Б
…_пg_proc
_пg_proc:
Г
В
„т,#8
Т
testb 38«,#1
ўI0053
Е
Д
Б
I0053:
јдќ
ул
јжл
П
sal дcl
Э
Ю
Ц
Ф
Т
Ч
test 34«,л
je I0056
Т
ƒв34
јЎ,м
Ч
not л
÷д«
∞
Ґ
„б_mproc
јв40
cwd
iрv м
џе–
¶
А
”_sys_getт
К
К
јд–
„б8
ј–,л
Т
Ѕ–
Ѕ10«
И
”_adjust
§
Щ
ўI0056
Т
Ґ
„б_mproc
јг40
cwd
iрv н
Ѕ36«
У
А
”_sys_пg
§
Е
Д
Б
I0056:
јдќ
ул
Э
Ю
Ѕ_core_bits
Ц
Э
Ю
Ц
јжл
Н
shr дcl
÷б1
Э
Ю
Ц
ђ
је4(с)
јдќ
 19«,al
Ќѕц
je I005C
И
”_dump_core
К
I005C:
З
А
И
”_mm_exit
К
К
Е
Д
Б
…_do_alarm
_do_alarm:
Г
В
А
А
Э
Ю
јд_mm_in+4
Ц
ђ
є
Ѕ_who
”_set_alarm
К
К
Ф
Ч
Е
Д
Б
…_set_alarm
_set_alarm:
Г
В
А
А
ј_m_пg+2,#1
Т
ј_m_пg+4,м
јб60
mul ќ
Ћем
ј_m_пg+10,л
ј_m_пg+10+2,м
Ќќц
je I0073
јб40
mul ≈
ї
ƒв_mproc+38
јѕ,м
Ђ
or б16
∞
ћI0074
I0073:
јб40
mul ≈
ї
ƒв_mproc+38
јѕ,м
Ђ
÷б65519
∞
I0074:
јб_m_пg
А
јб-3
А
”_sendrec
К
К
Щ
je I0076
јб32768
А
јб_1
А
”_panic
К
К
I0076:
је_m_пg+10
ј∆,м
јл,∆
Е
Д
Б
…_do_pause
_do_pause:
Г
В
А
је_mp
ƒв38
ј∆,м
Ђ
or б8
∞
ј_dont_reply,#1
З
Е
Д
Б
…_unpause
_unpause:
Г
В
А
А
јб40
mul ≈
ї
ƒв_mproc
ј∆,м
І
testb 38«,#8
je I0093
І
testb 38«,#4
ўI0093
І
ƒв38
јѕ,м
Ђ
÷б65527
∞
З
А
А
јб-4
А
И
”_reply
ƒт,#8
Е
Д
Б
I0093:
І
testb 38«,#2
je I0097
І
testb 38«,#4
ўI0097
І
ƒв38
јѕ,м
Ђ
÷б65533
∞
З
А
А
јб-4
А
И
”_reply
ƒт,#8
Е
Д
Б
I0097:
З
А
А
И
јб65
А
”_tell_fs
ƒт,#8
Е
Д
Б
_dump_core:
Г
В
„т,#356
Ґ
„б_mproc
јв40
cwd
iрv м
ј-32‘,л
З
А
А
Ѕ-32‘
П2
А
”_tell_fs
ƒт,#8
Т
ји≈
јд28(п)
Ќ26«,л
je I00A3
З
А
П
А
З
А
П2
А
”_tell_fs
ƒт,#8
Е
Д
Б
I00A3:
је_mp
ј-352(с),м
Т
ј_mp,м
і
А
џд-30(с)
А
јб_core_name
А
”_allowed
§
ј-320(с),л
і
А
џд-60(с)
А
јб_2
А
”_allowed
§
ј-322(с),л
је-352(с)
ј_mp,м
Ќ-320(с)ц
jl I00A6
Ѕ-320(с)
”_close
К
I00A6:
Ќ-322(с)ц
jl I00A9
Ѕ-322(с)
”_close
К
I00A9:
Т
Ќ28«ц
ўI00AC
ј-320(с)ц
I00AC:
Ќ-322(с)ц
jl I00AF
Ќ-320(с)ц
jge I00AE
Ќ-320(с),#-2
ўI00AF
I00AE:
јб511
А
јб_core_name
А
”_creat
К
К
ј-320(с),л
З
А
П
А
З
А
јд#12
А
”_tell_fs
ƒт,#8
Ќ-320(с)ц
jge I00A14
Е
Д
Б
I00A14:
Т
ƒв19
ј-35≈,м
је-35≈
З
М
А
Э
Ю
Н
Ц
or б128
Э
Ю
Ц
је-35≈
Ї
ј-31‘ц
I00A19:
Ќ-31‘,#3
jge I00A16
јб6
mul -31‘
ї
ƒе≈
јг4
јд4«
sal дcl
Ћем
ј-33≈,л
ј-332(с),м
јб4
А
џд-33≈
А
Ѕ-320(с)
”_write
§
Щ
jge I00A17
Ѕ-320(с)
”_close
К
Е
Д
Б
I00A17:
№-31‘
ћI00A19
I00A16:
џе-31ќ
ј-330(с),м
З
је-330(с)
ј-350(с),м
ј-34‘,л
ј-31‘ц
I00A20:
Ќ-31‘,#3
jge I00A10
јб6
mul -31‘
ї
ƒе≈
З
јг4
је«
©
2: sal в1
rcl б1
®
1:
ј-33‘,м
ј-33ќ,л
јб6
mul -31‘
ї
ƒе≈
З
јг4
је4«
jcxz 1f
2: sal в1
rcl б1
®
1:
ј-342(с),м
ј-340(с),л
I00A22:
јд-342(с)
је-340(с)
„б0
sbb в0
ў1f
÷дл
je 1f
№м
1: 
or ем
jle I00A1E
јд-342(с)
је-340(с)
„б256
sbb в0
ў1f
÷дл
je 1f
№м
1: 
or ем
jge I00A25
Ѕ-340(с)
Ѕ-342(с)
ћI00A26
I00A25:
З
А
і56
А
I00A26:
√-34ќ
√-34≈
Ѕ-34≈
Ѕ-34ќ
Ѕ-34‘
Ѕ-350(с)
П
А
З
А
Ѕ-33ќ
Ѕ-33‘
Ѕ-31‘
Ѕ-32‘
”_mem_copy
ƒт,#20
ј-32≈,л
Ѕ-34ќ
џд-31ќ
А
Ѕ-320(с)
”_write
§
ј-32ќ,л
Ќ-32≈ц
jl I00A27
Ќ-32ќц
jge I00A28
I00A27:
Ѕ-320(с)
”_close
К
Е
Д
Б
I00A28:
јд-33‘
је-33ќ
ƒд-34ќ
adc е-34≈
ј-33‘,л
ј-33ќ,м
јд-342(с)
је-340(с)
„д-34ќ
sbb е-34≈
ј-342(с),л
ј-340(с),м
ћI00A22
I00A1E:
№-31‘
ћI00A20
I00AF:
З
А
П
А
З
А
П2
А
”_tell_fs
ƒт,#8
Ѕ-320(с)
”_close
К
Е
Д
Б
I00A10:
Ѕ-320(с)
”_close
К
Е
Д
Б
≥
_m_пg: .zerow 24/2
Ѓ
_1:
¬27745
¬29281
¬8301
¬29285
Є
_2:
¬46
Ж
